app/controllers/api/v1/dashboard_controller.rb

      def load_recent_heard
        @recent_albums = current_user.recently_heards.order("created_at DESC").limit(4).map(&:album)
---
SELECT "recently_heards".* FROM "recently_heards" WHERE "recently_heards"."user_id" = ? ORDER BY created_at DESC LIMIT ?  [["user_id", 4], ["LIMIT", 4]]

      def load_recommendations
        heard_categories = @recent_albums.map(&:category)
        if heard_categories.present?
          @recommended_albums = Album.joins(:category, :songs).where(category: heard_categories).order("songs.played_count")
                                    .select("distinct albums.*").limit(12)
        else
          @recommended_albums = Album.all.limit(12)
---
SELECT distinct albums.* FROM "albums" INNER JOIN "categories" ON "categories"."id" = "albums"."category_id" INNER JOIN "songs" ON "songs"."album_id" = "albums"."id" WHERE "albums"."category_id" IN (?, ?, ?, ?) ORDER BY songs.played_count LIMIT ?  [["category_id", 1], ["category_id", 1], ["category_id", 2], ["category_id", 4], ["LIMIT", 12]]
SELECT "albums".* FROM "albums"