app/controllers/api/v1/favorites_controller.rb

    def index
        @favorite_albums = current_user.favorites.where(favoritable_type: "Album").map(&:favoritable)
        @favorite_songs = current_user.favorites.where(favoritable_type: "Song").map(&:favoritable)
        @favorite_artists = current_user.favorites.where(favoritable_type: "Artist").map(&:favoritable)
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."favoritable_type" = ?  [["user_id", 4], ["favoritable_type", "Album"]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."favoritable_type" = ?  [["user_id", 4], ["favoritable_type", "Song"]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."favoritable_type" = ?  [["user_id", 4], ["favoritable_type", "Artist"]]

    def create
        @favoritable = current_user.favorites.new(favoritable_type: params[:favoritable_type], favoritable_id: params[:id])
        @favoritable.save
---
INSERT INTO "favorites" ("user_id", "favoritable_type", "favoritable_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["favoritable_type", "Song"], ["favoritable_id", 5], ["created_at", "2020-04-22 01:11:22.773433"], ["updated_at", "2020-04-22 01:11:22.773433"]]

    def destroy
        @favoritable = current_user.favorites.find_by(favoritable_type: params[:favoritable_type], favoritable_id: params[:id])
        @favoritable.destroy
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."favoritable_type" = ? AND "favorites"."favoritable_id" = ? LIMIT ?  [["user_id", 1], ["favoritable_type", "Song"], ["favoritable_id", 6], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 11]]