app/models/user.rb

  def is_favorite? kind, id
    self.favorites.where(favoritable_type: kind, favoritable_id: id).present?
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."favoritable_type" = ? AND "favorites"."favoritable_id" = ?  [["user_id", 1], ["favoritable_type", "Song"], ["favoritable_id", 5]]